podonoghue/usbdm-firmware/BootloopMK/Project_Headers/MK20DN32M5.h
/****************************************************************************************************//**
 * @file     MK20DN32M5.h
 *
 * @brief    CMSIS Cortex-M Peripheral Access Layer Header File for MK20D5.
 *           Equivalent: MK20DX128M5, MK20DN64M5, MK20DX32M5, MK20DN32M5, MK20DX64M5, MK20DN128M5, FRDM_K20D50M
 *
 * @version  V0.0
 * @date     2015/07
 *
 *******************************************************************************************************/

#ifndef MCU_MK20D5
#define MCU_MK20D5

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/**
* @addtogroup Interrupt_vector_numbers_GROUP Interrupt vector numbers
* @brief Vector numbers required for NVIC functions
* @{
*/
/* -------------------------  Interrupt Number Definition  ------------------------ */

/**
 * Interrupt vector numbers
 */
typedef enum {
/* ------------------------  Processor Exceptions Numbers  ------------------------- */
  Reset_IRQn                    = -15,   /**<   1 Reset Vector, invoked on Power up and warm reset                                 */
  NonMaskableInt_IRQn           = -14,   /**<   2 Non maskable Interrupt, cannot be stopped or preempted                           */
  HardFault_IRQn                = -13,   /**<   3 Hard Fault, all classes of Fault                                                 */
  MemoryManagement_IRQn         = -12,   /**<   4 Memory Management, MPU mismatch, including Access Violation and No Match         */
  BusFault_IRQn                 = -11,   /**<   5 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault   */
  UsageFault_IRQn               = -10,   /**<   6 Usage Fault, i.e. Undef Instruction, Illegal State Transition                    */
  SVCall_IRQn                   =  -5,   /**<  11 System Service Call via SVC instruction                                          */
  DebugMonitor_IRQn             =  -4,   /**<  12 Debug Monitor                                                                    */
  PendSV_IRQn                   =  -2,   /**<  14 Pendable request for system service                                              */
  SysTick_IRQn                  =  -1,   /**<  15 System Tick Timer                                                                */
/* ----------------------   MK20D5 VectorTable                       ---------------------- */
  DMA0_IRQn                     =   0,   /**<  16 DMA channel 0 transfer complete interrupt                                        */
  DMA1_IRQn                     =   1,   /**<  17 DMA channel 1 transfer complete interrupt                                        */
  DMA2_IRQn                     =   2,   /**<  18 DMA channel 2 transfer complete interrupt                                        */
  DMA3_IRQn                     =   3,   /**<  19 DMA channel 3 transfer complete interrupt                                        */
  DMA_Error_IRQn                =   4,   /**<  20 DMA error interrupt                                                              */
  FTFL_Command_IRQn             =   6,   /**<  22 FTFL interrupt                                                                   */
  FTFL_Collision_IRQn           =   7,   /**<  23 FTFL Read collision interrupt                                                    */
  LVD_LVW_IRQn                  =   8,   /**<  24 PMC Low Voltage Detect, Low Voltage Warning                                      */
  LLW_IRQn                      =   9,   /**<  25 LLW Low Leakage Wakeup                                                           */
  Watchdog_IRQn                 =  10,   /**<  26 WDOG interrupt                                                                   */
  I2C0_IRQn                     =  11,   /**<  27 I2C0 interrupt                                                                   */
  SPI0_IRQn                     =  12,   /**<  28 SPI0 interrupt                                                                   */
  I2S0_Tx_IRQn                  =  13,   /**<  29 I2S0 transmit interrupt                                                          */
  I2S0_Rx_IRQn                  =  14,   /**<  30 I2S0 receive interrupt                                                           */
  UART0_LON_IRQn                =  15,   /**<  31 UART0 LON interrupt                                                              */
  UART0_RX_TX_IRQn              =  16,   /**<  32 UART0 receive/transmit interrupt                                                 */
  UART0_ERR_IRQn                =  17,   /**<  33 UART0 error interrupt                                                            */
  UART1_RX_TX_IRQn              =  18,   /**<  34 UART1 receive/transmit interrupt                                                 */
  UART1_ERR_IRQn                =  19,   /**<  35 UART1 error interrupt                                                            */
  UART2_RX_TX_IRQn              =  20,   /**<  36 UART2 receive/transmit interrupt                                                 */
  UART2_ERR_IRQn                =  21,   /**<  37 UART0 error interrupt                                                            */
  ADC0_IRQn                     =  22,   /**<  38 ADC0 interrupt                                                                   */
  CMP0_IRQn                     =  23,   /**<  39 CMP0 interrupt                                                                   */
  CMP1_IRQn                     =  24,   /**<  40 CMP1 interrupt                                                                   */
  FTM0_IRQn                     =  25,   /**<  41 FTM0 fault, overflow and channels interrupt                                      */
  FTM1_IRQn                     =  26,   /**<  42 FTM1 fault, overflow and channels interrupt                                      */
  CMT_IRQn                      =  27,   /**<  43 CMT interrupt                                                                    */
  RTC_IRQn                      =  28,   /**<  44 RTC interrupt                                                                    */
  RTC_Seconds_IRQn              =  29,   /**<  45 RTC seconds interrupt                                                            */
  PIT0_IRQn                     =  30,   /**<  46 PIT timer channel 0 interrupt                                                    */
  PIT1_IRQn                     =  31,   /**<  47 PIT timer channel 1 interrupt                                                    */
  PIT2_IRQn                     =  32,   /**<  48 PIT timer channel 2 interrupt                                                    */
  PIT3_IRQn                     =  33,   /**<  49 PIT timer channel 3 interrupt                                                    */
  PDB0_IRQn                     =  34,   /**<  50 PDB0 Programmable Delay Block interrupt                                          */
  USB0_IRQn                     =  35,   /**<  51 USB0 OTG interrupt                                                               */
  USBDCD_IRQn                   =  36,   /**<  52 USBDCD interrupt                                                                 */
  TSI0_IRQn                     =  37,   /**<  53 TSI0 interrupt                                                                   */
  MCG_IRQn                      =  38,   /**<  54 MCG interrupt                                                                    */
  LPTMR0_IRQn                   =  39,   /**<  55 LPTMR Low Power Timer interrupt                                                  */
  PORTA_IRQn                    =  40,   /**<  56 Port A interrupt                                                                 */
  PORTB_IRQn                    =  41,   /**<  57 Port B interrupt                                                                 */
  PORTC_IRQn                    =  42,   /**<  58 Port C interrupt                                                                 */
  PORTD_IRQn                    =  43,   /**<  59 Port D interrupt                                                                 */
  PORTE_IRQn                    =  44,   /**<  60 Port E interrupt                                                                 */
  SWI_IRQn                      =  45,   /**<  61 Software interrupt                                                               */
} IRQn_Type;

/**
 * @} */ /* End group Interrupt_vector_numbers_GROUP 
 */
/**
* @addtogroup Interrupt_handler_prototypes_GROUP Interrupt handler prototypes
* @brief Prototypes for interrupt handlers
* @{
*/
/* -------------------------  Exception Handlers  ------------------------ */
extern void NMI_Handler(void);                 /**< Non maskable Interrupt, cannot be stopped or preempted                           */
extern void HardFault_Handler(void);           /**< Hard Fault, all classes of Fault                                                 */
extern void MemManage_Handler(void);           /**< Memory Management, MPU mismatch, including Access Violation and No Match         */
extern void BusFault_Handler(void);            /**< Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault   */
extern void UsageFault_Handler(void);          /**< Usage Fault, i.e. Undef Instruction, Illegal State Transition                    */
extern void SVC_Handler(void);                 /**< System Service Call via SVC instruction                                          */
extern void DebugMon_Handler(void);            /**< Debug Monitor                                                                    */
extern void PendSV_Handler(void);              /**< Pendable request for system service                                              */
extern void SysTick_Handler(void);             /**< System Tick Timer                                                                */
extern void DMA0_IRQHandler(void);             /**< DMA channel 0 transfer complete interrupt                                        */
extern void DMA1_IRQHandler(void);             /**< DMA channel 1 transfer complete interrupt                                        */
extern void DMA2_IRQHandler(void);             /**< DMA channel 2 transfer complete interrupt                                        */
extern void DMA3_IRQHandler(void);             /**< DMA channel 3 transfer complete interrupt                                        */
extern void DMA_Error_IRQHandler(void);        /**< DMA error interrupt                                                              */
extern void FTFL_Command_IRQHandler(void);     /**< FTFL interrupt                                                                   */
extern void FTFL_Collision_IRQHandler(void);   /**< FTFL Read collision interrupt                                                    */
extern void LVD_LVW_IRQHandler(void);          /**< PMC Low Voltage Detect, Low Voltage Warning                                      */
extern void LLW_IRQHandler(void);              /**< LLW Low Leakage Wakeup                                                           */
extern void Watchdog_IRQHandler(void);         /**< WDOG interrupt                                                                   */
extern void I2C0_IRQHandler(void);             /**< I2C0 interrupt                                                                   */
extern void SPI0_IRQHandler(void);             /**< SPI0 interrupt                                                                   */
extern void I2S0_Tx_IRQHandler(void);          /**< I2S0 transmit interrupt                                                          */
extern void I2S0_Rx_IRQHandler(void);          /**< I2S0 receive interrupt                                                           */
extern void UART0_LON_IRQHandler(void);        /**< UART0 LON interrupt                                                              */
extern void UART0_RX_TX_IRQHandler(void);      /**< UART0 receive/transmit interrupt                                                 */
extern void UART0_ERR_IRQHandler(void);        /**< UART0 error interrupt                                                            */
extern void UART1_RX_TX_IRQHandler(void);      /**< UART1 receive/transmit interrupt                                                 */
extern void UART1_ERR_IRQHandler(void);        /**< UART1 error interrupt                                                            */
extern void UART2_RX_TX_IRQHandler(void);      /**< UART2 receive/transmit interrupt                                                 */
extern void UART2_ERR_IRQHandler(void);        /**< UART0 error interrupt                                                            */
extern void ADC0_IRQHandler(void);             /**< ADC0 interrupt                                                                   */
extern void CMP0_IRQHandler(void);             /**< CMP0 interrupt                                                                   */
extern void CMP1_IRQHandler(void);             /**< CMP1 interrupt                                                                   */
extern void FTM0_IRQHandler(void);             /**< FTM0 fault, overflow and channels interrupt                                      */
extern void FTM1_IRQHandler(void);             /**< FTM1 fault, overflow and channels interrupt                                      */
extern void CMT_IRQHandler(void);              /**< CMT interrupt                                                                    */
extern void RTC_IRQHandler(void);              /**< RTC interrupt                                                                    */
extern void RTC_Seconds_IRQHandler(void);      /**< RTC seconds interrupt                                                            */
extern void PIT0_IRQHandler(void);             /**< PIT timer channel 0 interrupt                                                    */
extern void PIT1_IRQHandler(void);             /**< PIT timer channel 1 interrupt                                                    */
extern void PIT2_IRQHandler(void);             /**< PIT timer channel 2 interrupt                                                    */
extern void PIT3_IRQHandler(void);             /**< PIT timer channel 3 interrupt                                                    */
extern void PDB0_IRQHandler(void);             /**< PDB0 Programmable Delay Block interrupt                                          */
extern void USB0_IRQHandler(void);             /**< USB0 OTG interrupt                                                               */
extern void USBDCD_IRQHandler(void);           /**< USBDCD interrupt                                                                 */
extern void TSI0_IRQHandler(void);             /**< TSI0 interrupt                                                                   */
extern void MCG_IRQHandler(void);              /**< MCG interrupt                                                                    */
extern void LPTMR0_IRQHandler(void);           /**< LPTMR Low Power Timer interrupt                                                  */
extern void PORTA_IRQHandler(void);            /**< Port A interrupt                                                                 */
extern void PORTB_IRQHandler(void);            /**< Port B interrupt                                                                 */
extern void PORTC_IRQHandler(void);            /**< Port C interrupt                                                                 */
extern void PORTD_IRQHandler(void);            /**< Port D interrupt                                                                 */
extern void PORTE_IRQHandler(void);            /**< Port E interrupt                                                                 */
extern void SWI_IRQHandler(void);              /**< Software interrupt                                                               */

/**
 * @} */ /* End group Interrupt_handler_prototypes_GROUP 
 */
/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/**
* @addtogroup Cortex_Core_Configuration_GROUP Cortex Core Configuration
* @brief Configuration of the cm4 Processor and Core Peripherals
* @{
*/
#define __CM4_REV                 0x0100     /**< CPU Revision                                        */
#define __MPU_PRESENT             0          /**< Whether MPU is present                              */
#define __NVIC_PRIO_BITS          4          /**< Number of implemented bits in NVIC PRIO register    */
#define __Vendor_SysTickConfig    0          /**< Whether Vendor implemented SYSTICK timer is present */
#define __FPU_PRESENT             0          /**< Whether FPU is present                              */
#define __VTOR_PRESENT            1          /**< Whether VTOR register is present                    */

/**
 * @} */ /* End group Cortex_Core_Configuration_GROUP 
 */
#include "core_cm4.h"           /* Processor and core peripherals     */
#include "system.h"             /* Device specific configuration file */

#ifndef __IO
#define __IO volatile 
#endif

#ifndef __I
#define __I volatile const
#endif

