podonoghue/usbdm-firmware/BootloopMK/Project_Headers/MK20DN32M5.h
#define UART_SFIFO_RXEMPT_MASK                   (0x01UL << UART_SFIFO_RXEMPT_SHIFT)                 /*!< UART0_SFIFO: RXEMPT Mask                */
#define UART_SFIFO_RXEMPT_SHIFT                  6                                                   /*!< UART0_SFIFO: RXEMPT Position            */
#define UART_SFIFO_TXEMPT_MASK                   (0x01UL << UART_SFIFO_TXEMPT_SHIFT)                 /*!< UART0_SFIFO: TXEMPT Mask                */
#define UART_SFIFO_TXEMPT_SHIFT                  7                                                   /*!< UART0_SFIFO: TXEMPT Position            */
/* ------- TWFIFO Bit Fields                        ------ */
#define UART_TWFIFO_TXWATER_MASK                 (0xFFUL << UART_TWFIFO_TXWATER_SHIFT)               /*!< UART0_TWFIFO: TXWATER Mask              */
#define UART_TWFIFO_TXWATER_SHIFT                0                                                   /*!< UART0_TWFIFO: TXWATER Position          */
#define UART_TWFIFO_TXWATER(x)                   (((uint8_t)(((uint8_t)(x))<<UART_TWFIFO_TXWATER_SHIFT))&UART_TWFIFO_TXWATER_MASK) /*!< UART0_TWFIFO                            */
/* ------- TCFIFO Bit Fields                        ------ */
#define UART_TCFIFO_TXCOUNT_MASK                 (0xFFUL << UART_TCFIFO_TXCOUNT_SHIFT)               /*!< UART0_TCFIFO: TXCOUNT Mask              */
#define UART_TCFIFO_TXCOUNT_SHIFT                0                                                   /*!< UART0_TCFIFO: TXCOUNT Position          */
#define UART_TCFIFO_TXCOUNT(x)                   (((uint8_t)(((uint8_t)(x))<<UART_TCFIFO_TXCOUNT_SHIFT))&UART_TCFIFO_TXCOUNT_MASK) /*!< UART0_TCFIFO                            */
/* ------- RWFIFO Bit Fields                        ------ */
#define UART_RWFIFO_RXWATER_MASK                 (0xFFUL << UART_RWFIFO_RXWATER_SHIFT)               /*!< UART0_RWFIFO: RXWATER Mask              */
#define UART_RWFIFO_RXWATER_SHIFT                0                                                   /*!< UART0_RWFIFO: RXWATER Position          */
#define UART_RWFIFO_RXWATER(x)                   (((uint8_t)(((uint8_t)(x))<<UART_RWFIFO_RXWATER_SHIFT))&UART_RWFIFO_RXWATER_MASK) /*!< UART0_RWFIFO                            */
/* ------- RCFIFO Bit Fields                        ------ */
#define UART_RCFIFO_RXCOUNT_MASK                 (0xFFUL << UART_RCFIFO_RXCOUNT_SHIFT)               /*!< UART0_RCFIFO: RXCOUNT Mask              */
#define UART_RCFIFO_RXCOUNT_SHIFT                0                                                   /*!< UART0_RCFIFO: RXCOUNT Position          */
#define UART_RCFIFO_RXCOUNT(x)                   (((uint8_t)(((uint8_t)(x))<<UART_RCFIFO_RXCOUNT_SHIFT))&UART_RCFIFO_RXCOUNT_MASK) /*!< UART0_RCFIFO                            */
/* ------- C7816 Bit Fields                         ------ */
#define UART_C7816_ISO_7816E_MASK                (0x01UL << UART_C7816_ISO_7816E_SHIFT)              /*!< UART0_C7816: ISO_7816E Mask             */
#define UART_C7816_ISO_7816E_SHIFT               0                                                   /*!< UART0_C7816: ISO_7816E Position         */
#define UART_C7816_TTYPE_MASK                    (0x01UL << UART_C7816_TTYPE_SHIFT)                  /*!< UART0_C7816: TTYPE Mask                 */
#define UART_C7816_TTYPE_SHIFT                   1                                                   /*!< UART0_C7816: TTYPE Position             */
#define UART_C7816_INIT_MASK                     (0x01UL << UART_C7816_INIT_SHIFT)                   /*!< UART0_C7816: INIT Mask                  */
#define UART_C7816_INIT_SHIFT                    2                                                   /*!< UART0_C7816: INIT Position              */
#define UART_C7816_ANACK_MASK                    (0x01UL << UART_C7816_ANACK_SHIFT)                  /*!< UART0_C7816: ANACK Mask                 */
#define UART_C7816_ANACK_SHIFT                   3                                                   /*!< UART0_C7816: ANACK Position             */
#define UART_C7816_ONACK_MASK                    (0x01UL << UART_C7816_ONACK_SHIFT)                  /*!< UART0_C7816: ONACK Mask                 */
#define UART_C7816_ONACK_SHIFT                   4                                                   /*!< UART0_C7816: ONACK Position             */
/* ------- IE7816 Bit Fields                        ------ */
#define UART_IE7816_RXTE_MASK                    (0x01UL << UART_IE7816_RXTE_SHIFT)                  /*!< UART0_IE7816: RXTE Mask                 */
#define UART_IE7816_RXTE_SHIFT                   0                                                   /*!< UART0_IE7816: RXTE Position             */
#define UART_IE7816_TXTE_MASK                    (0x01UL << UART_IE7816_TXTE_SHIFT)                  /*!< UART0_IE7816: TXTE Mask                 */
#define UART_IE7816_TXTE_SHIFT                   1                                                   /*!< UART0_IE7816: TXTE Position             */
#define UART_IE7816_GTVE_MASK                    (0x01UL << UART_IE7816_GTVE_SHIFT)                  /*!< UART0_IE7816: GTVE Mask                 */
#define UART_IE7816_GTVE_SHIFT                   2                                                   /*!< UART0_IE7816: GTVE Position             */
#define UART_IE7816_INITDE_MASK                  (0x01UL << UART_IE7816_INITDE_SHIFT)                /*!< UART0_IE7816: INITDE Mask               */
#define UART_IE7816_INITDE_SHIFT                 4                                                   /*!< UART0_IE7816: INITDE Position           */
#define UART_IE7816_BWTE_MASK                    (0x01UL << UART_IE7816_BWTE_SHIFT)                  /*!< UART0_IE7816: BWTE Mask                 */
#define UART_IE7816_BWTE_SHIFT                   5                                                   /*!< UART0_IE7816: BWTE Position             */
#define UART_IE7816_CWTE_MASK                    (0x01UL << UART_IE7816_CWTE_SHIFT)                  /*!< UART0_IE7816: CWTE Mask                 */
#define UART_IE7816_CWTE_SHIFT                   6                                                   /*!< UART0_IE7816: CWTE Position             */
#define UART_IE7816_WTE_MASK                     (0x01UL << UART_IE7816_WTE_SHIFT)                   /*!< UART0_IE7816: WTE Mask                  */
#define UART_IE7816_WTE_SHIFT                    7                                                   /*!< UART0_IE7816: WTE Position              */
/* ------- IS7816 Bit Fields                        ------ */
#define UART_IS7816_RXT_MASK                     (0x01UL << UART_IS7816_RXT_SHIFT)                   /*!< UART0_IS7816: RXT Mask                  */
#define UART_IS7816_RXT_SHIFT                    0                                                   /*!< UART0_IS7816: RXT Position              */
#define UART_IS7816_TXT_MASK                     (0x01UL << UART_IS7816_TXT_SHIFT)                   /*!< UART0_IS7816: TXT Mask                  */
#define UART_IS7816_TXT_SHIFT                    1                                                   /*!< UART0_IS7816: TXT Position              */
#define UART_IS7816_GTV_MASK                     (0x01UL << UART_IS7816_GTV_SHIFT)                   /*!< UART0_IS7816: GTV Mask                  */
#define UART_IS7816_GTV_SHIFT                    2                                                   /*!< UART0_IS7816: GTV Position              */
#define UART_IS7816_INITD_MASK                   (0x01UL << UART_IS7816_INITD_SHIFT)                 /*!< UART0_IS7816: INITD Mask                */
#define UART_IS7816_INITD_SHIFT                  4                                                   /*!< UART0_IS7816: INITD Position            */
#define UART_IS7816_BWT_MASK                     (0x01UL << UART_IS7816_BWT_SHIFT)                   /*!< UART0_IS7816: BWT Mask                  */
#define UART_IS7816_BWT_SHIFT                    5                                                   /*!< UART0_IS7816: BWT Position              */
#define UART_IS7816_CWT_MASK                     (0x01UL << UART_IS7816_CWT_SHIFT)                   /*!< UART0_IS7816: CWT Mask                  */
#define UART_IS7816_CWT_SHIFT                    6                                                   /*!< UART0_IS7816: CWT Position              */
#define UART_IS7816_WT_MASK                      (0x01UL << UART_IS7816_WT_SHIFT)                    /*!< UART0_IS7816: WT Mask                   */
#define UART_IS7816_WT_SHIFT                     7                                                   /*!< UART0_IS7816: WT Position               */
/* ------- WP7816T0 Bit Fields                      ------ */
#define UART_WP7816T0_WI_MASK                    (0xFFUL << UART_WP7816T0_WI_SHIFT)                  /*!< UART0_WP7816T0: WI Mask                 */
#define UART_WP7816T0_WI_SHIFT                   0                                                   /*!< UART0_WP7816T0: WI Position             */
#define UART_WP7816T0_WI(x)                      (((uint8_t)(((uint8_t)(x))<<UART_WP7816T0_WI_SHIFT))&UART_WP7816T0_WI_MASK) /*!< UART0_WP7816T0                          */
/* ------- WP7816T1 Bit Fields                      ------ */
#define UART_WP7816T1_BWI_MASK                   (0x0FUL << UART_WP7816T1_BWI_SHIFT)                 /*!< UART0_WP7816T1: BWI Mask                */
#define UART_WP7816T1_BWI_SHIFT                  0                                                   /*!< UART0_WP7816T1: BWI Position            */
#define UART_WP7816T1_BWI(x)                     (((uint8_t)(((uint8_t)(x))<<UART_WP7816T1_BWI_SHIFT))&UART_WP7816T1_BWI_MASK) /*!< UART0_WP7816T1                          */
#define UART_WP7816T1_CWI_MASK                   (0x0FUL << UART_WP7816T1_CWI_SHIFT)                 /*!< UART0_WP7816T1: CWI Mask                */
#define UART_WP7816T1_CWI_SHIFT                  4                                                   /*!< UART0_WP7816T1: CWI Position            */
#define UART_WP7816T1_CWI(x)                     (((uint8_t)(((uint8_t)(x))<<UART_WP7816T1_CWI_SHIFT))&UART_WP7816T1_CWI_MASK) /*!< UART0_WP7816T1                          */
/* ------- WN7816 Bit Fields                        ------ */
#define UART_WN7816_GTN_MASK                     (0xFFUL << UART_WN7816_GTN_SHIFT)                   /*!< UART0_WN7816: GTN Mask                  */
#define UART_WN7816_GTN_SHIFT                    0                                                   /*!< UART0_WN7816: GTN Position              */
#define UART_WN7816_GTN(x)                       (((uint8_t)(((uint8_t)(x))<<UART_WN7816_GTN_SHIFT))&UART_WN7816_GTN_MASK) /*!< UART0_WN7816                            */
/* ------- WF7816 Bit Fields                        ------ */
#define UART_WF7816_GTFD_MASK                    (0xFFUL << UART_WF7816_GTFD_SHIFT)                  /*!< UART0_WF7816: GTFD Mask                 */
#define UART_WF7816_GTFD_SHIFT                   0                                                   /*!< UART0_WF7816: GTFD Position             */
#define UART_WF7816_GTFD(x)                      (((uint8_t)(((uint8_t)(x))<<UART_WF7816_GTFD_SHIFT))&UART_WF7816_GTFD_MASK) /*!< UART0_WF7816                            */
/* ------- ET7816 Bit Fields                        ------ */
#define UART_ET7816_RXTHRESHOLD_MASK             (0x0FUL << UART_ET7816_RXTHRESHOLD_SHIFT)           /*!< UART0_ET7816: RXTHRESHOLD Mask          */
#define UART_ET7816_RXTHRESHOLD_SHIFT            0                                                   /*!< UART0_ET7816: RXTHRESHOLD Position      */
#define UART_ET7816_RXTHRESHOLD(x)               (((uint8_t)(((uint8_t)(x))<<UART_ET7816_RXTHRESHOLD_SHIFT))&UART_ET7816_RXTHRESHOLD_MASK) /*!< UART0_ET7816                            */
#define UART_ET7816_TXTHRESHOLD_MASK             (0x0FUL << UART_ET7816_TXTHRESHOLD_SHIFT)           /*!< UART0_ET7816: TXTHRESHOLD Mask          */
#define UART_ET7816_TXTHRESHOLD_SHIFT            4                                                   /*!< UART0_ET7816: TXTHRESHOLD Position      */
#define UART_ET7816_TXTHRESHOLD(x)               (((uint8_t)(((uint8_t)(x))<<UART_ET7816_TXTHRESHOLD_SHIFT))&UART_ET7816_TXTHRESHOLD_MASK) /*!< UART0_ET7816                            */
/* ------- TL7816 Bit Fields                        ------ */
#define UART_TL7816_TLEN_MASK                    (0xFFUL << UART_TL7816_TLEN_SHIFT)                  /*!< UART0_TL7816: TLEN Mask                 */
#define UART_TL7816_TLEN_SHIFT                   0                                                   /*!< UART0_TL7816: TLEN Position             */
#define UART_TL7816_TLEN(x)                      (((uint8_t)(((uint8_t)(x))<<UART_TL7816_TLEN_SHIFT))&UART_TL7816_TLEN_MASK) /*!< UART0_TL7816                            */
/* ------- C6 Bit Fields                            ------ */
#define UART_C6_CP_MASK                          (0x01UL << UART_C6_CP_SHIFT)                        /*!< UART0_C6: CP Mask                       */
#define UART_C6_CP_SHIFT                         4                                                   /*!< UART0_C6: CP Position                   */
#define UART_C6_CE_MASK                          (0x01UL << UART_C6_CE_SHIFT)                        /*!< UART0_C6: CE Mask                       */
#define UART_C6_CE_SHIFT                         5                                                   /*!< UART0_C6: CE Position                   */
#define UART_C6_TX709_MASK                       (0x01UL << UART_C6_TX709_SHIFT)                     /*!< UART0_C6: TX709 Mask                    */
#define UART_C6_TX709_SHIFT                      6                                                   /*!< UART0_C6: TX709 Position                */
#define UART_C6_EN709_MASK                       (0x01UL << UART_C6_EN709_SHIFT)                     /*!< UART0_C6: EN709 Mask                    */
#define UART_C6_EN709_SHIFT                      7                                                   /*!< UART0_C6: EN709 Position                */
/* ------- PCTH Bit Fields                          ------ */
#define UART_PCTH_PCTH_MASK                      (0xFFUL << UART_PCTH_PCTH_SHIFT)                    /*!< UART0_PCTH: PCTH Mask                   */
#define UART_PCTH_PCTH_SHIFT                     0                                                   /*!< UART0_PCTH: PCTH Position               */
#define UART_PCTH_PCTH(x)                        (((uint8_t)(((uint8_t)(x))<<UART_PCTH_PCTH_SHIFT))&UART_PCTH_PCTH_MASK) /*!< UART0_PCTH                              */
/* ------- PCTL Bit Fields                          ------ */
#define UART_PCTL_PCTL_MASK                      (0xFFUL << UART_PCTL_PCTL_SHIFT)                    /*!< UART0_PCTL: PCTL Mask                   */
#define UART_PCTL_PCTL_SHIFT                     0                                                   /*!< UART0_PCTL: PCTL Position               */
#define UART_PCTL_PCTL(x)                        (((uint8_t)(((uint8_t)(x))<<UART_PCTL_PCTL_SHIFT))&UART_PCTL_PCTL_MASK) /*!< UART0_PCTL                              */
/* ------- B1T Bit Fields                           ------ */
#define UART_B1T_B1T_MASK                        (0xFFUL << UART_B1T_B1T_SHIFT)                      /*!< UART0_B1T: B1T Mask                     */
#define UART_B1T_B1T_SHIFT                       0                                                   /*!< UART0_B1T: B1T Position                 */
#define UART_B1T_B1T(x)                          (((uint8_t)(((uint8_t)(x))<<UART_B1T_B1T_SHIFT))&UART_B1T_B1T_MASK) /*!< UART0_B1T                               */
/* ------- SDTH Bit Fields                          ------ */
#define UART_SDTH_SDTH_MASK                      (0xFFUL << UART_SDTH_SDTH_SHIFT)                    /*!< UART0_SDTH: SDTH Mask                   */
#define UART_SDTH_SDTH_SHIFT                     0                                                   /*!< UART0_SDTH: SDTH Position               */
#define UART_SDTH_SDTH(x)                        (((uint8_t)(((uint8_t)(x))<<UART_SDTH_SDTH_SHIFT))&UART_SDTH_SDTH_MASK) /*!< UART0_SDTH                              */
/* ------- SDTL Bit Fields                          ------ */
#define UART_SDTL_SDTL_MASK                      (0xFFUL << UART_SDTL_SDTL_SHIFT)                    /*!< UART0_SDTL: SDTL Mask                   */
#define UART_SDTL_SDTL_SHIFT                     0                                                   /*!< UART0_SDTL: SDTL Position               */
#define UART_SDTL_SDTL(x)                        (((uint8_t)(((uint8_t)(x))<<UART_SDTL_SDTL_SHIFT))&UART_SDTL_SDTL_MASK) /*!< UART0_SDTL                              */
/* ------- PRE Bit Fields                           ------ */
#define UART_PRE_PREAMBLE_MASK                   (0xFFUL << UART_PRE_PREAMBLE_SHIFT)                 /*!< UART0_PRE: PREAMBLE Mask                */
#define UART_PRE_PREAMBLE_SHIFT                  0                                                   /*!< UART0_PRE: PREAMBLE Position            */
#define UART_PRE_PREAMBLE(x)                     (((uint8_t)(((uint8_t)(x))<<UART_PRE_PREAMBLE_SHIFT))&UART_PRE_PREAMBLE_MASK) /*!< UART0_PRE                               */
/* ------- TPL Bit Fields                           ------ */
#define UART_TPL_TPL_MASK                        (0xFFUL << UART_TPL_TPL_SHIFT)                      /*!< UART0_TPL: TPL Mask                     */
#define UART_TPL_TPL_SHIFT                       0                                                   /*!< UART0_TPL: TPL Position                 */
#define UART_TPL_TPL(x)                          (((uint8_t)(((uint8_t)(x))<<UART_TPL_TPL_SHIFT))&UART_TPL_TPL_MASK) /*!< UART0_TPL                               */
/* ------- IE Bit Fields                            ------ */
#define UART_IE_TXFIE_MASK                       (0x01UL << UART_IE_TXFIE_SHIFT)                     /*!< UART0_IE: TXFIE Mask                    */
#define UART_IE_TXFIE_SHIFT                      0                                                   /*!< UART0_IE: TXFIE Position                */
#define UART_IE_PSIE_MASK                        (0x01UL << UART_IE_PSIE_SHIFT)                      /*!< UART0_IE: PSIE Mask                     */
#define UART_IE_PSIE_SHIFT                       1                                                   /*!< UART0_IE: PSIE Position                 */
#define UART_IE_PCTEIE_MASK                      (0x01UL << UART_IE_PCTEIE_SHIFT)                    /*!< UART0_IE: PCTEIE Mask                   */
#define UART_IE_PCTEIE_SHIFT                     2                                                   /*!< UART0_IE: PCTEIE Position               */
#define UART_IE_PTXIE_MASK                       (0x01UL << UART_IE_PTXIE_SHIFT)                     /*!< UART0_IE: PTXIE Mask                    */
#define UART_IE_PTXIE_SHIFT                      3                                                   /*!< UART0_IE: PTXIE Position                */
#define UART_IE_PRXIE_MASK                       (0x01UL << UART_IE_PRXIE_SHIFT)                     /*!< UART0_IE: PRXIE Mask                    */
#define UART_IE_PRXIE_SHIFT                      4                                                   /*!< UART0_IE: PRXIE Position                */
#define UART_IE_ISDIE_MASK                       (0x01UL << UART_IE_ISDIE_SHIFT)                     /*!< UART0_IE: ISDIE Mask                    */
#define UART_IE_ISDIE_SHIFT                      5                                                   /*!< UART0_IE: ISDIE Position                */
#define UART_IE_WBEIE_MASK                       (0x01UL << UART_IE_WBEIE_SHIFT)                     /*!< UART0_IE: WBEIE Mask                    */
#define UART_IE_WBEIE_SHIFT                      6                                                   /*!< UART0_IE: WBEIE Position                */
/* ------- WB Bit Fields                            ------ */
#define UART_WB_WBASE_MASK                       (0xFFUL << UART_WB_WBASE_SHIFT)                     /*!< UART0_WB: WBASE Mask                    */
#define UART_WB_WBASE_SHIFT                      0                                                   /*!< UART0_WB: WBASE Position                */
#define UART_WB_WBASE(x)                         (((uint8_t)(((uint8_t)(x))<<UART_WB_WBASE_SHIFT))&UART_WB_WBASE_MASK) /*!< UART0_WB                                */
/* ------- S3 Bit Fields                            ------ */
#define UART_S3_TXFF_MASK                        (0x01UL << UART_S3_TXFF_SHIFT)                      /*!< UART0_S3: TXFF Mask                     */
#define UART_S3_TXFF_SHIFT                       0                                                   /*!< UART0_S3: TXFF Position                 */
#define UART_S3_PSF_MASK                         (0x01UL << UART_S3_PSF_SHIFT)                       /*!< UART0_S3: PSF Mask                      */
#define UART_S3_PSF_SHIFT                        1                                                   /*!< UART0_S3: PSF Position                  */
#define UART_S3_PCTEF_MASK                       (0x01UL << UART_S3_PCTEF_SHIFT)                     /*!< UART0_S3: PCTEF Mask                    */
#define UART_S3_PCTEF_SHIFT                      2                                                   /*!< UART0_S3: PCTEF Position                */
#define UART_S3_PTXF_MASK                        (0x01UL << UART_S3_PTXF_SHIFT)                      /*!< UART0_S3: PTXF Mask                     */
#define UART_S3_PTXF_SHIFT                       3                                                   /*!< UART0_S3: PTXF Position                 */
#define UART_S3_PRXF_MASK                        (0x01UL << UART_S3_PRXF_SHIFT)                      /*!< UART0_S3: PRXF Mask                     */
#define UART_S3_PRXF_SHIFT                       4                                                   /*!< UART0_S3: PRXF Position                 */
#define UART_S3_ISD_MASK                         (0x01UL << UART_S3_ISD_SHIFT)                       /*!< UART0_S3: ISD Mask                      */
#define UART_S3_ISD_SHIFT                        5                                                   /*!< UART0_S3: ISD Position                  */
#define UART_S3_WBEF_MASK                        (0x01UL << UART_S3_WBEF_SHIFT)                      /*!< UART0_S3: WBEF Mask                     */
#define UART_S3_WBEF_SHIFT                       6                                                   /*!< UART0_S3: WBEF Position                 */
#define UART_S3_PEF_MASK                         (0x01UL << UART_S3_PEF_SHIFT)                       /*!< UART0_S3: PEF Mask                      */
#define UART_S3_PEF_SHIFT                        7                                                   /*!< UART0_S3: PEF Position                  */
/* ------- S4 Bit Fields                            ------ */
#define UART_S4_FE_MASK                          (0x01UL << UART_S4_FE_SHIFT)                        /*!< UART0_S4: FE Mask                       */
#define UART_S4_FE_SHIFT                         0                                                   /*!< UART0_S4: FE Position                   */
#define UART_S4_ILCV_MASK                        (0x01UL << UART_S4_ILCV_SHIFT)                      /*!< UART0_S4: ILCV Mask                     */
#define UART_S4_ILCV_SHIFT                       1                                                   /*!< UART0_S4: ILCV Position                 */
#define UART_S4_CDET_MASK                        (0x03UL << UART_S4_CDET_SHIFT)                      /*!< UART0_S4: CDET Mask                     */
#define UART_S4_CDET_SHIFT                       2                                                   /*!< UART0_S4: CDET Position                 */
#define UART_S4_CDET(x)                          (((uint8_t)(((uint8_t)(x))<<UART_S4_CDET_SHIFT))&UART_S4_CDET_MASK) /*!< UART0_S4                                */
